# Real Estate Price Prediction Mumbai

In [122]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

## Data Cleaning

In [123]:
df = pd.read_csv('Mumbai1.csv')
df.head()

,Price,Area,Location,No. of Bedrooms,New/Resale,Gymnasium,Lift Available,Car Parking,Maintenance Staff,24x7 Security,Children's Play Area,Clubhouse,Intercom,Landscaped Gardens,Indoor Games,Gas Connection,Jogging Track,Swimming Pool
0,4850000,720,Kharghar,1,0,0,1,1,1,1,0,0,0,0,0,0,0,0
1,4500000,600,Kharghar,1,0,1,1,1,1,1,0,1,0,0,0,0,1,1
2,6700000,650,Kharghar,1,0,1,1,1,1,1,1,1,1,0,0,0,1,1
3,4500000,650,Kharghar,1,0,0,1,1,1,1,0,0,1,1,0,0,0,0
4,5000000,665,Kharghar,1,0,0,1,1,1,1,0,0,1,1,0,0,0,0

#### Many columns are unnecessary like swimming pool, jogging track, indore games, gardens, etc. so removing those columns

In [124]:
df1 = df.drop(["New/Resale","Intercom","Gas Connection","Jogging Track","Landscaped Gardens","Indoor Games","Maintenance Staff","24x7 Security","Children's Play Area","Swimming Pool"],axis='columns')
df1.head()

,Price,Area,Location,No. of Bedrooms,Gymnasium,Lift Available,Car Parking,Clubhouse
0,4850000,720,Kharghar,1,0,1,1,0
1,4500000,600,Kharghar,1,1,1,1,1
2,6700000,650,Kharghar,1,1,1,1,1
3,4500000,650,Kharghar,1,0,1,1,0
4,5000000,665,Kharghar,1,0,1,1,0

In [125]:
df1.rename(columns={'No. of Bedrooms':'bhk'},inplace=True)
df1.rename(columns={'Area':'sqft_area'},inplace=True)
df1.rename(columns={'Gymnasium':'gym'},inplace=True)
df1.rename(columns={'Lift Available':'lift'},inplace=True)
df1.rename(columns={'Car Parking':'parking'},inplace=True)
df1.head()

     Price  sqft_area  Location  bhk  gym  lift  parking  Clubhouse
0  4850000        720  Kharghar    1    0     1        1          0
1  4500000        600  Kharghar    1    1     1        1          1
2  6700000        650  Kharghar    1    1     1        1          1
3  4500000        650  Kharghar    1    0     1        1          0
4  5000000        665  Kharghar    1    0     1        1          0

In [126]:
df1.isnull().sum()

Price        0
sqft_area    0
Location     0
bhk          0
gym          0
lift         0
parking      0
Clubhouse    0
dtype: int64

#### As there are no null values in the data set, moving forward

### Feature Engineering

In [127]:
df1['sqft_area'].unique()

array([ 720,  600,  650, ...,  250, 1162,  435], dtype=int64)

In [128]:
def is_int(x):
    try:
        int(X)
    except:
        return False
    return True

In [129]:
df1[~(df1['sqft_area'].apply(is_int))].head()

     Price  sqft_area  Location  bhk  gym  lift  parking  Clubhouse
0  4850000        720  Kharghar    1    0     1        1          0
1  4500000        600  Kharghar    1    1     1        1          1
2  6700000        650  Kharghar    1    1     1        1          1
3  4500000        650  Kharghar    1    0     1        1          0
4  5000000        665  Kharghar    1    0     1        1          0

In [130]:
df1.isnull().sum()

Price        0
sqft_area    0
Location     0
bhk          0
gym          0
lift         0
parking      0
Clubhouse    0
dtype: int64

### Making price_per_sqft column

In [131]:
df1['price_per_sqft'] = round(df1['Price']/df1['sqft_area'],2)
df1.head()

,Price,sqft_area,Location,bhk,gym,lift,parking,Clubhouse,price_per_sqft
0,4850000,720,Kharghar,1,0,1,1,0,6736.11
1,4500000,600,Kharghar,1,1,1,1,1,7500.00
2,6700000,650,Kharghar,1,1,1,1,1,10307.69
3,4500000,650,Kharghar,1,0,1,1,0,6923.08
4,5000000,665,Kharghar,1,0,1,1,0,7518.80

In [132]:
df1['price_per_sqft'].describe()

count      6347.000000
mean      13555.465878
std        9573.921384
min        1597.440000
25%        7234.040000
50%       10493.830000
75%       17142.860000
max      109950.520000
Name: price_per_sqft, dtype: float64

In [133]:
df2 = df1.copy()

In [134]:
df2['Price'] = df2['Price']/100000
df2.head()

,Price,sqft_area,Location,bhk,gym,lift,parking,Clubhouse,price_per_sqft
0,48.5,720,Kharghar,1,0,1,1,0,6736.11
1,45.0,600,Kharghar,1,1,1,1,1,7500.00
2,67.0,650,Kharghar,1,1,1,1,1,10307.69
3,45.0,650,Kharghar,1,0,1,1,0,6923.08
4,50.0,665,Kharghar,1,0,1,1,0,7518.80

### Sorting location column

In [135]:
df2.Location.unique()

array(['Kharghar', 'Sector-13 Kharghar', 'Sector 18 Kharghar',
       'Sector 20 Kharghar', 'Sector 15 Kharghar', 'Dombivali',
       'Churchgate', 'Prabhadevi', 'Jogeshwari West', 'Kalyan East',
       'Malad East', 'Virar East', 'Virar', 'Malad West', 'Borivali East',
       'Mira Road East', 'Goregaon West', 'Kandivali West',
       'Borivali West', 'Kandivali East', 'Andheri East', 'Goregaon East',
       'Wadala', 'Ulwe', 'Dahisar', 'kandivali', 'Goregaon',
       'Bhandup West', 'thakur village kandivali east', 'Santacruz West',
       'Kanjurmarg', 'I C Colony', 'Dahisar W', 'Marol', 'Parel',
       'Lower Parel', 'Worli', 'Jogeshwari East', 'Chembur Shell Colony',
       'Central Avenue', 'Chembur East', 'Diamond Market Road', 'Mulund',
       'Nalasopara West', 'raheja vihar', 'Powai Lake', 'MHADA Colony 20',
       'Tolaram Colony', 'Taloja', 'Thane West', 'Vangani',
       'Sector 5 Ulwe', 'Sector12 New Panvel', 'Sector 17 Ulwe',
       'Sector9 Kamothe', 'Sector 19 Kharghar', 'Navi Basti',
       'Sector12 Kamothe', 'Sector 21 Kamothe', 'Rutu Enclave',
       'taloja panchanand', 'Virar West', 'Chembur', 'Sector 20 Kamothe',
       'Sector 22 Kamothe', 'Sector 18 Kamothe', 'Sector-5 Kamothe',
       'Sector-6A Kamothe', 'Sector 11 Kamothe', 'Sector-18 Ulwe',
       'Sector-12 Kamothe', 'azad nagar', 'Sindhi Society Chembur',
       'Kurla', 'Sahkar Nagar', 'Deonar', 'Thane', 'Jankalyan Nagar',
       'Badlapur', 'Ambarnath', 'Ambernath West', 'Vakola', 'Kamothe',
       'Kamothe Sector 16', 'Almeida Park', 'Khar', 'Bandra West',
       'Pali Hill', '15th Road', 'Palghar', 'Sector13 Kharghar',
       'Sector 21 Kharghar', 'Sector 12 Kharghar', 'Vivek Vidyalaya Marg',
       'Vasai east', 'Nahur', 'Badlapur West', 'Panvel', 'Kalyan',
       'Badlapur East', 'Mira Bhayandar', 'Juhu', 'Naigaon East',
       'Sector 21 Ulwe', 'Bandra East', 'Dronagiri', 'Nerul', 'Karanjade',
       'Sanpada', 'Sector-8 Ulwe', 'Sector-3 Ulwe', 'Sector 23 Ulwe',
       'ULWE SECTOR 19', 'Ghodbunder Road', 'Bhiwandi', 'Vasai',
       'Nala Sopara', 'Dadar East', 'Ghatkopar', 'Breach Candy',
       'Worli South Mumbai', 'Asangaon', 'Koparkhairane Station Road',
       'Kopar Khairane Sector 19A', 'Koper Khairane',
       'Eastern Express Highway Vikhroli', 'Magathane', 'Rawal Pada',
       'Ambernath East', 'Dokali Pada', 'Dattapada', 'Rajendra Nagar',
       'Kulupwadi', 'Samata Nagar Thakur Village', 'Mira Road and Beyond',
       'West Amardeep Colony', 'Pant Nagar', 'mumbai', 'Four Bungalows',
       'no 9', 'kolshet', 'Hiranandani Meadows', 'Kalpataru', 'Petali',
       'Kharghar Sector 34C', 'Ghatkopar East',
       'Mumbai Agra National Highway', 'vasant vihar thane west',
       'Kalyan West', 'Shirgaon', 'Pokhran 2', 'juhu tara', 'Peddar Road',
       'Palm Beach', 'Sector 10', 'Sector 19 Kamothe', 'Tilak Nagar',
       'Ghatkopar West', 'Tardeo', 'Napeansea Road', 'Mahalaxmi',
       'Dahisar West', 'Mulund West', 'Natakwala Lane', 'Link Road',
       'Devidas Cross Lane', 'Soniwadi Road', 'Haridas Nagar', 'Shimpoli',
       'TPS Road', 'Off Shimpoli road', 'Rustomjee Global City',
       'Sunil Nagar', 'Sector 30 Kharghar', 'Sector 12 A', 'Sector 18',
       'Sector13 Khanda Colony', 'Sector16 Airoli', 'Ranjanpada',
       'Sector 15', 'Sector 35G', 'Sector 5', 'Sector 35I Kharghar',
       'Sector35D Kharghar', 'Sector34 A Kharghar', 'Sector 30',
       'Sector 36 Kharghar', 'Sector 11 Belapur', 'Sector-34B Kharghar',
       'Dombivali East', 'Roadpali', 'Sector-50 Seawoods',
       'Mumbai Highway', 'Sector 7 Kharghar', 'Lokhandwala Township',
       'Andheri', 'Andheri West', 'Shastri Nagar', 'Wadala East Wadala',
       'Kalwa', 'PARSIK NAGAR', 'Maharashtra Nagar', 'Patlipada',
       'Belapur', 'Seawoods', 'Majiwada', '4 Bunglows', 'Airoli',
       'Kolshet Road', 'Sector 10 Khanda Colony', 'Pokharan Road',
       'Kharegaon', 'Panch Pakhadi', 'Sector 36 Kamothe',
       'Dombivli (West)', 'DN Nagar Road', 'Godrej Hill', 'Ganesh Nagar',
       'Haware City', 'Mahatma Gandhi Road', 'Akurli Nagar',
       'Kasar vadavali', 'Vasai West', 'Mumbai Nashik Expressway',
       'Katrap', 'Mira Road', 'Kasheli',
       'Western Express Highway Kandivali East', 'Vasind', 'KASHELI',
       'Thakurli', 'Shakti Nagar', 'Bhayandar East', 'Dahisar East',
       'ulhasnagar 4', 'Sector-26 Taloja', 'Koproli', 'Mumbai Central',
       'Greater Khanda', 'link road borivali west', 'Manpada',
       'Sector 2 Ulwe', 'Govind nagar', 'Krishanlal Marwah Marg',
       'Sector-9 Ulwe', 'Vikhroli', 'Kalamboli', 'Lokhandwala',
       'Patel Nagar', 'Yari Road', 'Thakur complex', 'Khar West',
       'Sector 11 Kharghar', 'Ghansoli', 'Sector8 Sanpada',
       'Jeejamata Nagar', 'Pandurangwadi', 'Shreyas Colony',
       'Kannamwar Nagar II', 'gokuldham', 'Bangur Nagar',
       'Shivaji Colony', 'Jawahar Nagar', 'Vedant Complex', 'Titwala',
       'Manvel pada Road', 'Govandi', 'Shilphata Road Thane',
       'Vasant Vihar', 'Thakur Village', 'Samata nagar', 'Wadi Bandar',
       'Kapurbawadi', 'Thane Belapur Road Kalwa', 'Suburbs Mumbai',
       'Ramdev Park', 'Sector-35 Kamothe',
       'Sector 58A Seawoods Navi Mumbai', 'Diva', 'Borivali',
       'Gundavali Gaothan', 'Kondivita Road', 'Koldongri', 'Saki Naka',
       'Bhayandar West', 'Versova', 'Hanuman Nagar', 'worli sea face ',
       'Sea Face', 'Shiv Sagar Estate', 'Grant Road West', 'Sriprastha',
       'Off Nepean Sea Road', 'Morya Nagar', 'Upper Worli',
       'worli sea Fase', 'Powai', 'Agripada', 'Sion', 'Girgaon',
       'IT Colony', 'Bhayandarpada', 'Sector-24 Kamothe', 'Phase 2',
       'Sector 6', 'Malad', 'Haji Ali', 'Majiwada thane', 'Yogi Hills',
       'Sector 19 Nerul', 'Owale', 'MG Road', 'roadpali navimumbai',
       'Taloja Bypass Nitalas Link Road', 'Rasayani', 'Sector 10 Kamothe',
       'kavesar', 'Kopara', 'royal palms goregaon east', 'Dadar West',
       'vrindavan society', 'CBD Belapur East', 'Parel Village',
       'Karave Nagar', 'Sector 19A Nerul', 'Antop Hill', 'Suman Nagar',
       'Bhakti Park', 'Hanuman Chowk', 'Willingdon', 'VishnuNagar',
       'Vichumbe', 'Vashi', 'Poonam Sagar Complex', 'Santacruz East',
       'Mulund East', 'Sector-8 Sanpada', 'Sector-9 Ghansoli', 'Balkum',
       'Hiranandani Estates', 'Vartak Nagar', 'Charkop', 'dhanukarwadi',
       'Vazira', 'Four Bunglows', 'Palava',
       'Oshiwara Police Station Road', 'Seven Bunglow', 'Poddar Road',
       'Gulmohar Road', 'Vile Parle E', 'Pokhran Road No 2',
       'Sainath Nagar', 'Kapur Bawdi', 'Manpada near Tiku ji ni wadi',
       'Kolshet Industrial Area', 'Sector16 Ulwe',
       'Anand Nagar Thane West', 'Charkop Sector 8', 'Vile Parle',
       'Marine Lines', 'Bandra Kurla Complex', 'sec 50 new',
       'Vakola Pipeline Road', 'Neral', 'Shil Phata', 'Ville Parle East',
       'matunga east', 'Dharavi', 'vile parle west', 'Anjurdive', 'Uran',
       'Boisar', 'Kanjurmarg East', 'Kurla West', 'Sewri', 'Matunga',
       'Goregaon (East)', 'Malabar Hill', 'Ambivali', 'Nalasopara East',
       'Vijay Nagar', 'Chedda Nagar', 'Kurla East', 'Kharodi',
       'Ville Parle West', 'Vikhroli West', 'Wadala East', 'Palidevad',
       'Vikroli East', 'Mahim', 'Khalapur', 'Karjat', 'Vitthalwadi',
       'Bhoiwada Kalyan', 'Beturkar Pada', 'Ambivli', 'Nilje Gaon',
       'Khopoli', 'Taloje', 'Gulal Wadi', 'Tilak Nagar Mumbai',
       'Chandivali', 'Nere', 'Kewale', 'Sector 9 Airoli', 'Diva Gaon',
       'Sen Nagar', 'Adaigaon', 'Syndicate', 'Gandhar Nagar', 'Byculla',
       'Padle Gaon'], dtype=object)

In [136]:
location_stats = df2.Location.value_counts()
location_stats

Kharghar             533
Thane West           418
Mira Road East       390
Ulwe                 319
Borivali West        176
                    ...
worli sea face         1
Sea Face               1
Shiv Sagar Estate      1
Natakwala Lane         1
Padle Gaon             1
Name: Location, Length: 413, dtype: int64

In [137]:
loc_lessthan_10 = location_stats[location_stats<=10]
loc_lessthan_10

Sector 19 Kharghar    10
Sion                  10
Majiwada              10
Sector12 Kamothe       9
kandivali              9
                      ..
worli sea face         1
Sea Face               1
Shiv Sagar Estate      1
Natakwala Lane         1
Padle Gaon             1
Name: Location, Length: 324, dtype: int64

In [138]:
df2.Location = df2.Location.apply(lambda x: 'others' if x in loc_lessthan_10 else x)
df2.head(15)

,Price,sqft_area,Location,bhk,gym,lift,parking,Clubhouse,price_per_sqft
0,48.5,720,Kharghar,1,0,1,1,0,6736.11
1,45.0,600,Kharghar,1,1,1,1,1,7500.00
2,67.0,650,Kharghar,1,1,1,1,1,10307.69
3,45.0,650,Kharghar,1,0,1,1,0,6923.08
4,50.0,665,Kharghar,1,0,1,1,0,7518.80
5,170.0,2000,Kharghar,4,1,1,1,1,8500.00
6,125.0,1550,Kharghar,3,0,1,1,0,8064.52
7,105.0,1370,others,3,0,1,1,0,7664.23
8,105.0,1356,Kharghar,3,1,1,1,1,7743.36
9,150.0,1680,Kharghar,3,1,1,1,1,8928.57
10,87.0,980,Kharghar,2,1,1,1,1,8877.55
11,90.0,1000,Kharghar,2,1,1,1,0,9000.00
12,110.0,1060,Kharghar,2,1,1,1,1,10377.36
13,105.0,1095,Kharghar,2,1,1,1,1,9589.04
14,97.0,1155,Kharghar,2,1,1,1,1,8398.27

## Outlier Removal

In [139]:
df2.sqft_area.describe()

count    6347.000000
mean     1004.327084
std       556.375703
min       200.000000
25%       650.000000
50%       905.000000
75%      1182.000000
max      8511.000000
Name: sqft_area, dtype: float64

In [140]:
df2[df2.sqft_area/(df2['bhk'])<300].head()

,Price,sqft_area,Location,bhk,gym,lift,parking,Clubhouse,price_per_sqft
239,112.0,573,Ulwe,2,1,1,1,1,19546.25
503,40.0,568,Bhiwandi,2,1,1,1,0,7042.25
545,66.0,550,Thane,2,1,1,1,1,12000.00
546,69.0,565,Thane,2,1,1,1,1,12212.39
547,68.0,547,Thane,2,1,1,1,1,12431.44

In [141]:
df2.shape

(6347, 9)

#### Usually, bedroom has area of >=300 sqft. Hence, in the above line, those data points are shown where sqft_area per bedroom is <300 sqft

In [142]:
df3 = df2[~(df2.sqft_area/(df2['bhk'])<300)]
df3.head()

,Price,sqft_area,Location,bhk,gym,lift,parking,Clubhouse,price_per_sqft
0,48.5,720,Kharghar,1,0,1,1,0,6736.11
1,45.0,600,Kharghar,1,1,1,1,1,7500.00
2,67.0,650,Kharghar,1,1,1,1,1,10307.69
3,45.0,650,Kharghar,1,0,1,1,0,6923.08
4,50.0,665,Kharghar,1,0,1,1,0,7518.80

In [143]:
df3.shape

(6187, 9)

In [144]:
df3.price_per_sqft.describe()

count      6187.000000
mean      13457.088230
std        9583.492648
min        1597.440000
25%        7142.860000
50%       10307.690000
75%       17022.660000
max      109950.520000
Name: price_per_sqft, dtype: float64

In [145]:
# def remove_msd_ouliers(df):
#     df_out = pd.DataFrame()
#     for key,subdf in df.groupby('Location'):
#         m = np.mean(subdf.price_per_sqft)
#         sd = np.std(subdf.price_per_sqft)
#         reduced_df = subdf[(subdf.price_per_sqft>(m-sd)) & (subdf.price_per_sqft<=(m+sd))]
#         df_out = pd.concat([df_out,reduced_df], ignore_index=False)
#         return df_out
# df4 = remove_msd_ouliers(df3)
# df4.shape (only 19 records left)

# not removing ouliers beyond (m+sd) and (m-sd)

In [146]:
df3.head()

,Price,sqft_area,Location,bhk,gym,lift,parking,Clubhouse,price_per_sqft
0,48.5,720,Kharghar,1,0,1,1,0,6736.11
1,45.0,600,Kharghar,1,1,1,1,1,7500.00
2,67.0,650,Kharghar,1,1,1,1,1,10307.69
3,45.0,650,Kharghar,1,0,1,1,0,6923.08
4,50.0,665,Kharghar,1,0,1,1,0,7518.80

In [147]:
df3.shape

(6187, 9)

In [148]:
df4 =  df3.drop(['price_per_sqft'],axis='columns')
df4.head()

   Price  sqft_area  Location  bhk  gym  lift  parking  Clubhouse
0   48.5        720  Kharghar    1    0     1        1          0
1   45.0        600  Kharghar    1    1     1        1          1
2   67.0        650  Kharghar    1    1     1        1          1
3   45.0        650  Kharghar    1    0     1        1          0
4   50.0        665  Kharghar    1    0     1        1          0

## Data Modeling

### One Hot Encoding

In [149]:
dummies = pd.get_dummies(df4.Location)
dummies.head()

,Airoli,Ambernath East,Ambernath West,Andheri,Andheri East,Andheri West,Badlapur East,Bandra East,Bandra West,Belapur,...,Ville Parle East,Virar,Virar East,Virar West,Wadala,Wadala East Wadala,Worli,matunga east,mumbai,others
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [150]:
df5 = pd.concat([df4,dummies.drop('others',axis='columns')],axis='columns')
df5.head()

,Price,sqft_area,Location,bhk,gym,lift,parking,Clubhouse,Airoli,Ambernath East,...,Vashi,Ville Parle East,Virar,Virar East,Virar West,Wadala,Wadala East Wadala,Worli,matunga east,mumbai
0,48.5,720,Kharghar,1,0,1,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,45.0,600,Kharghar,1,1,1,1,1,0,0,...,0,0,0,0,0,0,0,0,0,0
2,67.0,650,Kharghar,1,1,1,1,1,0,0,...,0,0,0,0,0,0,0,0,0,0
3,45.0,650,Kharghar,1,0,1,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,50.0,665,Kharghar,1,0,1,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [151]:
df5 = df5.drop(['Location'],axis='columns')
df5.head()

,Price,sqft_area,bhk,gym,lift,parking,Clubhouse,Airoli,Ambernath East,Ambernath West,...,Vashi,Ville Parle East,Virar,Virar East,Virar West,Wadala,Wadala East Wadala,Worli,matunga east,mumbai
0,48.5,720,1,0,1,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,45.0,600,1,1,1,1,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,67.0,650,1,1,1,1,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,45.0,650,1,0,1,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,50.0,665,1,0,1,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

### Modeling

In [152]:
X = df5.drop('Price',axis='columns')
X.head()

,sqft_area,bhk,gym,lift,parking,Clubhouse,Airoli,Ambernath East,Ambernath West,Andheri,...,Vashi,Ville Parle East,Virar,Virar East,Virar West,Wadala,Wadala East Wadala,Worli,matunga east,mumbai
0,720,1,0,1,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,600,1,1,1,1,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,650,1,1,1,1,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,650,1,0,1,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,665,1,0,1,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [153]:
y = df5.Price
y.head()

0    48.5
1    45.0
2    67.0
3    45.0
4    50.0
Name: Price, dtype: float64

### Splitting data into training and test set

In [154]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size =0.2, random_state=0)

In [155]:
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()
regressor.fit(X_train,y_train)

LinearRegression()

In [156]:
regressor.score(X_test,y_test)

0.7062530868106554

In [157]:
from sklearn.model_selection import ShuffleSplit
from sklearn.model_selection import cross_val_score

cv = ShuffleSplit(n_splits=5, test_size=0.2, random_state=0)

cross_val_score(LinearRegression(), X, y, cv=cv)

array([0.70625309, 0.67049873, 0.64913515, 0.63140057, 0.65354266])

In [161]:
from sklearn.model_selection import GridSearchCV

from sklearn.linear_model import Lasso
from sklearn.tree import DecisionTreeRegressor
from sklearn.ensemble import RandomForestRegressor
from sklearn.svm import SVR

def find_best_model_using_gridsearchcv(X,y):
    algos = {
        'linear_regression' : {
            'model': LinearRegression(),
            'params': {
                'normalize': [True, False]
            }
        },
        'lasso': {
            'model': Lasso(),
            'params': {
                'alpha': [1,2],
                'selection': ['random', 'cyclic']
            }
        },
        'decision_tree': {
            'model': DecisionTreeRegressor(),
            'params': {
                'criterion' : ['mse','friedman_mse'],
                'splitter': ['best','random']
            }
        }
    }
    scores = []
    cv = ShuffleSplit(n_splits=5, test_size=0.2, random_state=0)
    for algo_name, config in algos.items():
        gs =  GridSearchCV(config['model'], config['params'], cv=cv, return_train_score=False)
        gs.fit(X,y)
        scores.append({
            'model': algo_name,
            'best_score': gs.best_score_,
            'best_params': gs.best_params_
        })

    return pd.DataFrame(scores,columns=['model','best_score','best_params'])

find_best_model_using_gridsearchcv(X,y)

               model  best_score                               best_params
0  linear_regression    0.662166                      {'normalize': False}
1              lasso    0.583577       {'alpha': 1, 'selection': 'random'}
2      decision_tree    0.431438  {'criterion': 'mse', 'splitter': 'best'}

In [169]:
def predict_price(Location,sqft,bhk,gym,lift,parking,clubhouse):    
    loc_index = np.where(X.columns==Location)[0][0]

    x = np.zeros(len(X.columns))
    x[0] = sqft
    x[1] = bhk
    x[2] = gym
    x[3] = lift
    x[4] = parking
    x[5] = clubhouse
    if loc_index >= 0:
        x[loc_index] = 1

    return regressor.predict([x])[0]

In [170]:
df5.head()

,Price,sqft_area,bhk,gym,lift,parking,Clubhouse,Airoli,Ambernath East,Ambernath West,...,Vashi,Ville Parle East,Virar,Virar East,Virar West,Wadala,Wadala East Wadala,Worli,matunga east,mumbai
0,48.5,720,1,0,1,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,45.0,600,1,1,1,1,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,67.0,650,1,1,1,1,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,45.0,650,1,0,1,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,50.0,665,1,0,1,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [171]:
predict_price('Kharghar',1000,2,0,1,1,0)

76.97688851016076

In [ ]:
predict_price('Andheri West',1361,2,0,0,1,0)